zephyrproject-rtos/zephyr/drivers/dma/dma_stm32u5.c
/*
 * Copyright (c) 2016 Linaro Limited.
 * Copyright (c) 2019 Song Qiang <songqiang1304521@gmail.com>
 * Copyright (c) 2022 STMicroelectronics
 *
 * SPDX-License-Identifier: Apache-2.0
 */

/**
 * @brief Common part of DMA drivers for stm32U5.
 * @note  Functions named with stm32_dma_* are SoCs related functions
 *
 */

#include "dma_stm32.h"

#include <zephyr/init.h>
#include <zephyr/drivers/clock_control.h>
#include <zephyr/drivers/dma/dma_stm32.h>

#include <zephyr/logging/log.h>
#include <zephyr/irq.h>

#include <string.h>

LOG_MODULE_REGISTER(dma_stm32, CONFIG_DMA_LOG_LEVEL);

#define DT_DRV_COMPAT st_stm32u5_dma

#define STM32U5_DMA_LINKED_LIST_NODE_SIZE (2)
#define STM32U5_DMA_MAX_BURST_LENGTH      (64) /* Maximum number of beats in a burst */

#ifdef CONFIG_STM32_HAL2
#define STM32_DMA_SRC_DATA_WIDTH_BYTE		LL_DMA_SRC_DATA_WIDTH_BYTE
#define STM32_DMA_SRC_DATA_WIDTH_HALFWORD	LL_DMA_SRC_DATA_WIDTH_HALFWORD
#define STM32_DMA_SRC_DATA_WIDTH_WORD		LL_DMA_SRC_DATA_WIDTH_WORD
#define STM32_DMA_DEST_DATA_WIDTH_BYTE		LL_DMA_DEST_DATA_WIDTH_BYTE
#define STM32_DMA_DEST_DATA_WIDTH_HALFWORD	LL_DMA_DEST_DATA_WIDTH_HALFWORD
#define STM32_DMA_DEST_DATA_WIDTH_WORD		LL_DMA_DEST_DATA_WIDTH_WORD
#define STM32_DMA_PRIORITY_LOW_WEIGHT_LOW	LL_DMA_PRIORITY_LOW_WEIGHT_LOW
#define STM32_DMA_PRIORITY_LOW_WEIGHT_MID	LL_DMA_PRIORITY_LOW_WEIGHT_MID
#define STM32_DMA_PRIORITY_LOW_WEIGHT_HIGH	LL_DMA_PRIORITY_LOW_WEIGHT_HIGH
#define STM32_DMA_PRIORITY_HIGH			LL_DMA_PRIORITY_HIGH
#define STM32_DMA_SRC_ADDR_FIXED		LL_DMA_SRC_ADDR_FIXED
#define STM32_DMA_SRC_ADDR_INCREMENTED		LL_DMA_SRC_ADDR_INCREMENTED
#define STM32_DMA_DEST_ADDR_FIXED		LL_DMA_DEST_ADDR_FIXED
#define STM32_DMA_DEST_ADDR_INCREMENTED		LL_DMA_DEST_ADDR_INCREMENTED
#define STM32_DMA_LINKEDLIST_EXECUTION_Q	LL_DMA_LINKEDLIST_EXECUTION_Q
#define STM32_DMA_LINKEDLIST_EXECUTION_NODE	LL_DMA_LINKEDLIST_EXECUTION_NODE

/* Macro to give the LL dmax_Channel<y> from the DMAx base and channel 0..12 */
#define STM32_DMA_GET_CHANNEL(dmax, idx) \
	LL_DMA_GET_CHANNEL_INSTANCE((dmax), dma_stm32_id_to_stream(idx))
#else /* CONFIG_STM32_HAL2 */
#define STM32_DMA_SRC_DATA_WIDTH_BYTE		LL_DMA_SRC_DATAWIDTH_BYTE
#define STM32_DMA_SRC_DATA_WIDTH_HALFWORD	LL_DMA_SRC_DATAWIDTH_HALFWORD
#define STM32_DMA_SRC_DATA_WIDTH_WORD		LL_DMA_SRC_DATAWIDTH_WORD
#define STM32_DMA_DEST_DATA_WIDTH_BYTE		LL_DMA_DEST_DATAWIDTH_BYTE
#define STM32_DMA_DEST_DATA_WIDTH_HALFWORD	LL_DMA_DEST_DATAWIDTH_HALFWORD
#define STM32_DMA_DEST_DATA_WIDTH_WORD		LL_DMA_DEST_DATAWIDTH_WORD
#define STM32_DMA_PRIORITY_LOW_WEIGHT_LOW	LL_DMA_LOW_PRIORITY_LOW_WEIGHT
#define STM32_DMA_PRIORITY_LOW_WEIGHT_MID	LL_DMA_LOW_PRIORITY_MID_WEIGHT
#define STM32_DMA_PRIORITY_LOW_WEIGHT_HIGH	LL_DMA_LOW_PRIORITY_HIGH_WEIGHT
#define STM32_DMA_PRIORITY_HIGH			LL_DMA_HIGH_PRIORITY
#define STM32_DMA_SRC_ADDR_FIXED		LL_DMA_SRC_FIXED
#define STM32_DMA_SRC_ADDR_INCREMENTED		LL_DMA_SRC_INCREMENT
#define STM32_DMA_DEST_ADDR_FIXED		LL_DMA_DEST_FIXED
#define STM32_DMA_DEST_ADDR_INCREMENTED		LL_DMA_DEST_INCREMENT
#define STM32_DMA_LINKEDLIST_EXECUTION_Q	LL_DMA_LSM_FULL_EXECUTION
#define STM32_DMA_LINKEDLIST_EXECUTION_NODE	LL_DMA_LSM_1LINK_EXECUTION

#define STM32_DMA_GET_CHANNEL(dmax, idx) (dmax), dma_stm32_id_to_stream(idx)
#endif /* CONFIG_STM32_HAL2 */

static const uint32_t table_src_size[] = {
	STM32_DMA_SRC_DATA_WIDTH_BYTE,
	STM32_DMA_SRC_DATA_WIDTH_HALFWORD,
	STM32_DMA_SRC_DATA_WIDTH_WORD,
};

static const uint32_t table_dst_size[] = {
	STM32_DMA_DEST_DATA_WIDTH_BYTE,
	STM32_DMA_DEST_DATA_WIDTH_HALFWORD,
	STM32_DMA_DEST_DATA_WIDTH_WORD,
};

static const uint32_t table_priority[4] = {
	STM32_DMA_PRIORITY_LOW_WEIGHT_LOW,
	STM32_DMA_PRIORITY_LOW_WEIGHT_MID,
	STM32_DMA_PRIORITY_LOW_WEIGHT_HIGH,
	STM32_DMA_PRIORITY_HIGH,
};

static void dma_stm32_dump_stream_irq(const struct device *dev, uint32_t id)
{
	const struct dma_stm32_config *config = dev->config;
	DMA_TypeDef *dma = (DMA_TypeDef *)(config->base);

	stm32_dma_dump_stream_irq(dma, id);
}

static void dma_stm32_clear_stream_irq(const struct device *dev, uint32_t id)
{
	const struct dma_stm32_config *config = dev->config;
	DMA_TypeDef *dma = (DMA_TypeDef *)(config->base);

	dma_stm32_clear_tc(dma, id);
	dma_stm32_clear_ht(dma, id);
	stm32_dma_clear_stream_irq(dma, id);
}


uint32_t dma_stm32_id_to_stream(uint32_t id)
{
	static const uint32_t stream_nr[] = {
		LL_DMA_CHANNEL_0,
		LL_DMA_CHANNEL_1,
		LL_DMA_CHANNEL_2,
		LL_DMA_CHANNEL_3,
		LL_DMA_CHANNEL_4,
		LL_DMA_CHANNEL_5,
		LL_DMA_CHANNEL_6,
		LL_DMA_CHANNEL_7,
#ifdef LL_DMA_CHANNEL_8
		LL_DMA_CHANNEL_8,
		LL_DMA_CHANNEL_9,
		LL_DMA_CHANNEL_10,
		LL_DMA_CHANNEL_11,
		LL_DMA_CHANNEL_12,
		LL_DMA_CHANNEL_13,
		LL_DMA_CHANNEL_14,
		LL_DMA_CHANNEL_15,
#endif /* LL_DMA_CHANNEL_8 */
	};

	__ASSERT_NO_MSG(id < ARRAY_SIZE(stream_nr));

	return stream_nr[id];
}

bool dma_stm32_is_tc_active(DMA_TypeDef *dma, uint32_t id)
{
	return LL_DMA_IsActiveFlag_TC(STM32_DMA_GET_CHANNEL(dma, id));
}

void dma_stm32_clear_tc(DMA_TypeDef *dma, uint32_t id)
{
	LL_DMA_ClearFlag_TC(STM32_DMA_GET_CHANNEL(dma, id));
}

/* data transfer error */
static inline bool dma_stm32_is_dte_active(DMA_TypeDef *dma, uint32_t id)
{
	return LL_DMA_IsActiveFlag_DTE(STM32_DMA_GET_CHANNEL(dma, id));
}

/* link transfer error */
static inline bool dma_stm32_is_ule_active(DMA_TypeDef *dma, uint32_t id)
{
	return LL_DMA_IsActiveFlag_ULE(STM32_DMA_GET_CHANNEL(dma, id));
}

/* user setting error */
static inline bool dma_stm32_is_use_active(DMA_TypeDef *dma, uint32_t id)
{
	return LL_DMA_IsActiveFlag_USE(STM32_DMA_GET_CHANNEL(dma, id));
}

/* transfer error either a data or user or link error */
bool dma_stm32_is_te_active(DMA_TypeDef *dma, uint32_t id)
{
	return (
		LL_DMA_IsActiveFlag_DTE(STM32_DMA_GET_CHANNEL(dma, id)) ||
		LL_DMA_IsActiveFlag_ULE(STM32_DMA_GET_CHANNEL(dma, id)) ||
		LL_DMA_IsActiveFlag_USE(STM32_DMA_GET_CHANNEL(dma, id))
	);
}
/* clear transfer error either a data or user or link error */
void dma_stm32_clear_te(DMA_TypeDef *dma, uint32_t id)
{
	LL_DMA_ClearFlag_DTE(STM32_DMA_GET_CHANNEL(dma, id));
	LL_DMA_ClearFlag_ULE(STM32_DMA_GET_CHANNEL(dma, id));
	LL_DMA_ClearFlag_USE(STM32_DMA_GET_CHANNEL(dma, id));
}

bool dma_stm32_is_ht_active(DMA_TypeDef *dma, uint32_t id)
{
	return LL_DMA_IsActiveFlag_HT(STM32_DMA_GET_CHANNEL(dma, id));
}

void dma_stm32_clear_ht(DMA_TypeDef *dma, uint32_t id)
{
	LL_DMA_ClearFlag_HT(STM32_DMA_GET_CHANNEL(dma, id));
}

void stm32_dma_dump_stream_irq(DMA_TypeDef *dma, uint32_t id)
{
	LOG_INF("tc: %d, ht: %d, dte: %d, ule: %d, use: %d",
		dma_stm32_is_tc_active(dma, id),
		dma_stm32_is_ht_active(dma, id),
		dma_stm32_is_dte_active(dma, id),
		dma_stm32_is_ule_active(dma, id),
		dma_stm32_is_use_active(dma, id)
	);
}

