zephyrproject-rtos/zephyr/drivers/dma/dma_stm32u5.c
/* Check if nsecure masked interrupt is active on channel */
bool stm32_dma_is_tc_irq_active(DMA_TypeDef *dma, uint32_t id)
{
	return (LL_DMA_IsEnabledIT_TC(STM32_DMA_GET_CHANNEL(dma, id)) &&
		LL_DMA_IsActiveFlag_TC(STM32_DMA_GET_CHANNEL(dma, id)));
}

bool stm32_dma_is_ht_irq_active(DMA_TypeDef *dma, uint32_t id)
{
	return (LL_DMA_IsEnabledIT_HT(STM32_DMA_GET_CHANNEL(dma, id)) &&
		LL_DMA_IsActiveFlag_HT(STM32_DMA_GET_CHANNEL(dma, id)));
}

/* check if and irq of any type occurred on the channel */
#define stm32_dma_is_irq_active LL_DMA_IsActiveFlag_MIS

void stm32_dma_clear_stream_irq(DMA_TypeDef *dma, uint32_t id)
{
	dma_stm32_clear_te(dma, id);

	LL_DMA_ClearFlag_TO(STM32_DMA_GET_CHANNEL(dma, id));
	LL_DMA_ClearFlag_SUSP(STM32_DMA_GET_CHANNEL(dma, id));
}

bool stm32_dma_is_irq_happened(DMA_TypeDef *dma, uint32_t id)
{
	if (dma_stm32_is_te_active(dma, id)) {
		return true;
	}

	return false;
}

void stm32_dma_enable_stream(DMA_TypeDef *dma, uint32_t id)
{
	LL_DMA_EnableChannel(STM32_DMA_GET_CHANNEL(dma, id));
}

bool stm32_dma_is_enabled_stream(DMA_TypeDef *dma, uint32_t id)
{
	if (LL_DMA_IsEnabledChannel(STM32_DMA_GET_CHANNEL(dma, id)) == 1) {
		return true;
	}
	return false;
}

int stm32_dma_disable_stream(DMA_TypeDef *dma, uint32_t id)
{
	/* GPDMA channel abort sequence */
	LL_DMA_SuspendChannel(STM32_DMA_GET_CHANNEL(dma, id));

	/* reset the channel will disable it */
	LL_DMA_ResetChannel(STM32_DMA_GET_CHANNEL(dma, id));

	if (!stm32_dma_is_enabled_stream(dma, id)) {
		return 0;
	}

	return -EAGAIN;
}

void stm32_dma_set_mem_periph_address(DMA_TypeDef *dma,
					     uint32_t channel,
					     uint32_t src_addr,
					     uint32_t dest_addr)
{
	LL_DMA_ConfigAddresses(STM32_DMA_GET_CHANNEL(dma, channel), src_addr, dest_addr);
}

/* same function to set periph/mem addresses */
void stm32_dma_set_periph_mem_address(DMA_TypeDef *dma,
					     uint32_t channel,
					     uint32_t src_addr,
					     uint32_t dest_addr)
{
	LL_DMA_ConfigAddresses(STM32_DMA_GET_CHANNEL(dma, channel), src_addr, dest_addr);
}

static void dma_stm32_irq_handler(const struct device *dev, uint32_t id)
{
	const struct dma_stm32_config *config = dev->config;
	DMA_TypeDef *dma = (DMA_TypeDef *)(config->base);
	struct dma_stm32_stream *stream;
	uint32_t callback_arg;
	int status;

	__ASSERT_NO_MSG(id < config->max_streams);

	stream = &config->streams[id];
	/* The busy channel is pertinent if not overridden by the HAL */
	if ((stream->hal_override != true) && (stream->busy == false)) {
		/*
		 * When DMA channel is not overridden by HAL,
		 * ignore irq if the channel is not busy anymore
		 */
		dma_stm32_clear_stream_irq(dev, id);
		return;
	}
	callback_arg = id;

	/* The dma stream id is in range from 0..<dma-requests> */
	if (stm32_dma_is_ht_irq_active(dma, id)) {
		/* Let HAL DMA handle flags on its own */
		if (!stream->hal_override) {
			dma_stm32_clear_ht(dma, id);
		}
		status = DMA_STATUS_BLOCK;
	} else if (stm32_dma_is_tc_irq_active(dma, id)) {
		/* Assuming not cyclic transfer */
		if (stream->cyclic == false) {
			stream->busy = false;
		}
		/* Let HAL DMA handle flags on its own */
		if (!stream->hal_override) {
			dma_stm32_clear_tc(dma, id);
		}
		status = DMA_STATUS_COMPLETE;
	} else {
		/* Let HAL DMA handle flags on its own */
		if (!stream->hal_override) {
			LOG_ERR("Transfer Error.");
			stream->busy = false;
			dma_stm32_dump_stream_irq(dev, id);
			dma_stm32_clear_stream_irq(dev, id);
		}
		status = -EIO;
	}

	if (stream->dma_callback != NULL) {
		stream->dma_callback(dev, stream->user_data, callback_arg, status);
	}
}

static int dma_stm32_get_priority(uint8_t priority, uint32_t *ll_priority)
{
	if (priority >= ARRAY_SIZE(table_priority)) {
		LOG_ERR("Priority error. %d", priority);
		return -EINVAL;
	}

	*ll_priority = table_priority[priority];
	return 0;
}

static int dma_stm32_get_direction(enum dma_channel_direction direction,
				   uint32_t *ll_direction)
{
	switch (direction) {
	case MEMORY_TO_MEMORY:
		*ll_direction = LL_DMA_DIRECTION_MEMORY_TO_MEMORY;
		break;
	case MEMORY_TO_PERIPHERAL:
		*ll_direction = LL_DMA_DIRECTION_MEMORY_TO_PERIPH;
		break;
	case PERIPHERAL_TO_MEMORY:
		*ll_direction = LL_DMA_DIRECTION_PERIPH_TO_MEMORY;
		break;
	default:
		LOG_ERR("Direction error. %d", direction);
		return -EINVAL;
	}

	return 0;
}

#ifndef CONFIG_STM32_HAL2
static int dma_stm32_hal_map_data_size(uint32_t z_size, uint32_t *hal_size, uint32_t hal_byte,
				       uint32_t hal_halfword, uint32_t hal_word)
{
	switch (z_size) {
	case 1:
		*hal_size = hal_byte;
		return 0;
	case 2:
		*hal_size = hal_halfword;
		return 0;
	case 4:
		*hal_size = hal_word;
		return 0;
	default:
		return -ENOTSUP;
	}
}

static int dma_stm32_hal_map_mode(const struct dma_config *cfg, uint32_t *hal_mode)
{
	if (cfg->cyclic) {
#ifdef DMA_CIRCULAR
		*hal_mode = DMA_CIRCULAR;
#else
		return -ENOTSUP;
#endif
	} else {
		*hal_mode = DMA_NORMAL;
	}

	return 0;
}

static int dma_stm32_hal_map_addr_adj(enum dma_addr_adj z_adj, uint32_t *hal_inc,
				      uint32_t hal_inc_val, uint32_t hal_noinc_val)
{
	switch (z_adj) {
	case DMA_ADDR_ADJ_INCREMENT:
		*hal_inc = hal_inc_val;
		return 0;
	case DMA_ADDR_ADJ_NO_CHANGE:
		*hal_inc = hal_noinc_val;
		return 0;
	case DMA_ADDR_ADJ_DECREMENT:
		return -ENOTSUP;
	default:
		return -EINVAL;
	}
}

static int dma_stm32_hal_config_widths(const struct dma_config *cfg, DMA_InitTypeDef *hal_config)
{
	int ret;

	ret = dma_stm32_hal_map_data_size(cfg->source_data_size, &hal_config->SrcDataWidth,
					  DMA_SRC_DATAWIDTH_BYTE, DMA_SRC_DATAWIDTH_HALFWORD,
					  DMA_SRC_DATAWIDTH_WORD);
	if (ret < 0) {
		return ret;
	}

	return dma_stm32_hal_map_data_size(cfg->dest_data_size, &hal_config->DestDataWidth,
					   DMA_DEST_DATAWIDTH_BYTE, DMA_DEST_DATAWIDTH_HALFWORD,
					   DMA_DEST_DATAWIDTH_WORD);
}

static int dma_stm32_hal_config_increments(uint16_t source_addr_adj, uint16_t dest_addr_adj,
					   DMA_InitTypeDef *hal_config)
{
	int ret;

	ret = dma_stm32_hal_map_addr_adj(source_addr_adj, &hal_config->SrcInc,
					 DMA_SINC_INCREMENTED, DMA_SINC_FIXED);
	if (ret < 0) {
		return ret;
	}

