zephyrproject-rtos/zephyr/drivers/dma/dma_stm32u5.c
	return dma_stm32_hal_map_addr_adj(dest_addr_adj, &hal_config->DestInc,
					  DMA_DINC_INCREMENTED, DMA_DINC_FIXED);
}

/*
 * Default DMA driver configuration relies on these values,
 * in case the fields have not been initialized in the @p zephyr_config.
 *
 * hal_config->Request			= GPDMA1_REQUEST_ADC1;
 * hal_config->BlkHWRequest		= DMA_BREQ_SINGLE_BURST;
 * hal_config->Direction		= DMA_PERIPH_TO_MEMORY;
 * hal_config->SrcInc			= DMA_SINC_FIXED;
 * hal_config->DestInc			= DMA_DINC_FIXED;
 * hal_config->SrcDataWidth		= DMA_SRC_DATAWIDTH_BYTE;
 * hal_config->DestDataWidth		= DMA_DEST_DATAWIDTH_BYTE;
 * hal_config->Priority			= DMA_LOW_PRIORITY_LOW_WEIGHT;
 * hal_config->SrcBurstLength		= 0;
 * hal_config->DestBurstLength		= 0;
 * hal_config->TransferAllocatedPort	= DMA_SRC_ALLOCATED_PORT0;
 * hal_config->TransferEventMode	= DMA_TCEM_BLOCK_TRANSFER;
 * hal_config->Mode			= DMA_NORMAL;
 */
int dma_stm32_zcfg_to_halcfg(const struct device *dma, const struct dma_config *zephyr_config,
			     DMA_InitTypeDef *hal_config, uint16_t source_addr_adj,
			     uint16_t dest_addr_adj)
{
	int ret;

	__ASSERT_NO_MSG(dma != NULL && zephyr_config != NULL && hal_config != NULL);

	memset(hal_config, 0, sizeof(*hal_config));

	ret = dma_stm32_get_direction(zephyr_config->channel_direction, &hal_config->Direction);
	if (ret < 0) {
		return ret;
	}

	ret = dma_stm32_get_priority(zephyr_config->channel_priority, &hal_config->Priority);
	if (ret < 0) {
		return ret;
	}

	ret = dma_stm32_hal_config_widths(zephyr_config, hal_config);
	if (ret < 0) {
		return ret;
	}

	ret = dma_stm32_hal_map_mode(zephyr_config, &hal_config->Mode);
	if (ret < 0) {
		return ret;
	}

	ret = dma_stm32_hal_config_increments(source_addr_adj, dest_addr_adj, hal_config);
	if (ret < 0) {
		return ret;
	}

	hal_config->SrcBurstLength = zephyr_config->source_burst_length;
	hal_config->DestBurstLength = zephyr_config->dest_burst_length;

	hal_config->Request = zephyr_config->dma_slot;

#ifdef DMA_BREQ_SINGLE_BURST
	hal_config->BlkHWRequest = DMA_BREQ_SINGLE_BURST;
#endif

#ifdef DMA_TCEM_BLOCK_TRANSFER
	hal_config->TransferEventMode = DMA_TCEM_BLOCK_TRANSFER;
#endif

	return 0;
}
#endif /* CONFIG_STM32_HAL2 */

static int dma_stm32_disable_stream(DMA_TypeDef *dma, uint32_t id)
{
	int count = 0;

	for (;;) {
		if (stm32_dma_disable_stream(dma, id) == 0) {
			return 0;
		}
		/* After trying for 5 seconds, give up */
		if (count++ > (5 * 1000)) {
			return -EBUSY;
		}
		k_sleep(K_MSEC(1));
	}

	return 0;
}

static int dma_stm32_configure(const struct device *dev,
					     uint32_t id,
					     struct dma_config *config)
{
	const struct dma_stm32_config *dev_config = dev->config;
	struct dma_stm32_stream *stream = &dev_config->streams[id];
	DMA_TypeDef *dma = (DMA_TypeDef *)dev_config->base;
	uint32_t ll_priority;
	uint32_t ll_direction;
	int ret;

	if (id >= dev_config->max_streams) {
		LOG_ERR("cannot configure the dma stream %d.", id);
		return -EINVAL;
	}

	if (stream->busy) {
		LOG_ERR("dma stream %d is busy.", id);
		return -EBUSY;
	}

	if (dma_stm32_disable_stream(dma, id) != 0) {
		LOG_ERR("could not disable dma stream %d.", id);
		return -EBUSY;
	}

	dma_stm32_clear_stream_irq(dev, id);

	/* Check potential DMA override (if id parameters and stream are valid) */
	if (config->linked_channel == STM32_DMA_HAL_OVERRIDE) {
		/* DMA channel is overridden by HAL DMA
		 * Retain that the channel is busy and proceed to the minimal
		 * configuration to properly route the IRQ
		 */
		stream->busy = true;
		stream->hal_override = true;
		stream->dma_callback = config->dma_callback;
		stream->user_data = config->user_data;
		return 0;
	}

	if (config->head_block->block_size > DMA_STM32_MAX_DATA_ITEMS) {
		LOG_ERR("Data size too big: %d\n",
		       config->head_block->block_size);
		return -EINVAL;
	}

	if (config->dest_data_size != config->source_data_size) {
		/* This is not a strict error, but migth point to an issue.
		 * Mismatch can be used by peripherals that require 32-bit access,
		 * but produce 16-bit value (e.g. ADC, DAC)
		 */
		LOG_INF("source and dest data size differ.");
	}

	if (config->source_data_size != 4U &&
	    config->source_data_size != 2U &&
	    config->source_data_size != 1U) {
		LOG_ERR("source and dest unit size error, %d",
			config->source_data_size);
		return -EINVAL;
	}

#if !defined(CONFIG_SOC_SERIES_STM32C5X)
	if ((config->source_burst_length % config->source_data_size) != 0) {
		LOG_ERR("Source burst length %d is not aligned to source data size %d",
			config->source_burst_length, config->source_data_size);
		return -EINVAL;
	}

	if ((config->dest_burst_length % config->dest_data_size) != 0) {
		LOG_ERR("Destination burst length %d is not aligned to destination data size %d",
			config->dest_burst_length, config->dest_data_size);
		return -EINVAL;
	}

	uint32_t burst_beats = config->source_burst_length / config->source_data_size;

	if (burst_beats > STM32U5_DMA_MAX_BURST_LENGTH) {
		LOG_ERR("Source burst length %d is invalid", config->source_burst_length);
		return -EINVAL;
	} else if (burst_beats > 0) {
		LL_DMA_SetSrcBurstLength(STM32_DMA_GET_CHANNEL(dma, id), burst_beats);
	} else {
		/* Default HW behavior (upon reset) is a single beat burst */
		LOG_WRN("Accepting source burst length 0 for backwards compatibility");
		LL_DMA_SetSrcBurstLength(STM32_DMA_GET_CHANNEL(dma, id), 1U);
	}

	burst_beats = config->dest_burst_length / config->dest_data_size;

	if (burst_beats > STM32U5_DMA_MAX_BURST_LENGTH) {
		LOG_ERR("Destination burst length %d is invalid", config->dest_burst_length);
		return -EINVAL;
	} else if (burst_beats > 0) {
		LL_DMA_SetDestBurstLength(STM32_DMA_GET_CHANNEL(dma, id), burst_beats);
	} else {
		/* Default HW behavior (upon reset) is a single beat burst */
		LOG_WRN("Accepting destination burst length 0 for backwards compatibility");
		LL_DMA_SetDestBurstLength(STM32_DMA_GET_CHANNEL(dma, id), 1U);
	}
#endif /* !defined(CONFIG_SOC_SERIES_STM32C5X) */

	stream->busy		= true;
	stream->dma_callback	= config->dma_callback;
	stream->direction	= config->channel_direction;
	stream->user_data       = config->user_data;
	stream->src_size	= config->source_data_size;
	stream->dst_size	= config->dest_data_size;

	/* Check dest or source memory address, warn if 0 */
	if (config->head_block->source_address == 0) {
		LOG_WRN("source_buffer address is null.");
	}

	if (config->head_block->dest_address == 0) {
		LOG_WRN("dest_buffer address is null.");
	}

	LL_DMA_ConfigAddresses(STM32_DMA_GET_CHANNEL(dma, id),
		config->head_block->source_address,
		config->head_block->dest_address);

	ret = dma_stm32_get_priority(config->channel_priority, &ll_priority);
	if (ret < 0) {
		return ret;
	}

	LL_DMA_SetChannelPriorityLevel(STM32_DMA_GET_CHANNEL(dma, id), ll_priority);

	ret = dma_stm32_get_direction(config->channel_direction, &ll_direction);
	if (ret < 0) {
		return ret;
	}
	LL_DMA_SetDataTransferDirection(STM32_DMA_GET_CHANNEL(dma, id), ll_direction);

