zephyrproject-rtos/zephyr/drivers/dma/dma_stm32u5.c
	/* This part is for source */
	switch (config->head_block->source_addr_adj) {
	case DMA_ADDR_ADJ_INCREMENT:
		LL_DMA_SetSrcIncMode(STM32_DMA_GET_CHANNEL(dma, id),
				     STM32_DMA_SRC_ADDR_INCREMENTED);
		break;
	case DMA_ADDR_ADJ_NO_CHANGE:
		LL_DMA_SetSrcIncMode(STM32_DMA_GET_CHANNEL(dma, id), STM32_DMA_SRC_ADDR_FIXED);
		break;
	case DMA_ADDR_ADJ_DECREMENT:
		return -ENOTSUP;
	default:
		LOG_ERR("Memory increment error. %d",
			config->head_block->source_addr_adj);
		return -EINVAL;
	}
	LOG_DBG("Channel (%d) src inc (%x).", id,
		LL_DMA_GetSrcIncMode(STM32_DMA_GET_CHANNEL(dma, id)));

	/* This part is for dest */
	switch (config->head_block->dest_addr_adj) {
	case DMA_ADDR_ADJ_INCREMENT:
		LL_DMA_SetDestIncMode(STM32_DMA_GET_CHANNEL(dma, id),
				      STM32_DMA_DEST_ADDR_INCREMENTED);
		break;
	case DMA_ADDR_ADJ_NO_CHANGE:
		LL_DMA_SetDestIncMode(STM32_DMA_GET_CHANNEL(dma, id), STM32_DMA_DEST_ADDR_FIXED);
		break;
	case DMA_ADDR_ADJ_DECREMENT:
		return -ENOTSUP;
	default:
		LOG_ERR("Periph increment error. %d",
			config->head_block->dest_addr_adj);
		return -EINVAL;
	}
	LOG_DBG("Channel (%d) dest inc (%x).", id,
		LL_DMA_GetDestIncMode(STM32_DMA_GET_CHANNEL(dma, id)));

	stream->source_periph = (stream->direction == PERIPHERAL_TO_MEMORY);

	/* Set the data width, when source_data_size equals dest_data_size */
	int index = find_lsb_set(config->source_data_size) - 1;

	LL_DMA_SetSrcDataWidth(STM32_DMA_GET_CHANNEL(dma, id), table_src_size[index]);

	index = find_lsb_set(config->dest_data_size) - 1;
	LL_DMA_SetDestDataWidth(STM32_DMA_GET_CHANNEL(dma, id), table_dst_size[index]);

	LL_DMA_SetBlkDataLength(STM32_DMA_GET_CHANNEL(dma, id), config->head_block->block_size);

	/* The request ID is stored in the dma_slot */
	LL_DMA_SetPeriphRequest(STM32_DMA_GET_CHANNEL(dma, id), config->dma_slot);

	if (config->head_block->source_reload_en == 0) {
		LL_DMA_SetLinkStepMode(STM32_DMA_GET_CHANNEL(dma, id),
				       STM32_DMA_LINKEDLIST_EXECUTION_NODE);
		/* Initialize the DMA structure in non-cyclic mode only */
		LL_DMA_SetLinkedListAddrOffset(STM32_DMA_GET_CHANNEL(dma, id), 0);
	} else {/* cyclic mode */
		uint32_t linked_list_flags = 0;
		volatile uint32_t *linked_list_node =
			&dev_config->linked_list_buffer[id * STM32U5_DMA_LINKED_LIST_NODE_SIZE];
		/* We use "linked list" to emulate circular mode.
		 * The linked list can consists of just source and/or destination address.
		 * Other registers can remain the same. Linked list itself doesn't contain
		 * pointer to other item, since LLR register is not updated (ULL bit = 0).
		 */
		if (config->head_block->source_addr_adj == config->head_block->dest_addr_adj) {
			/* We update both source and destination address */
			linked_list_node[0] = config->head_block->source_address;
			linked_list_node[1] = config->head_block->dest_address;
			linked_list_flags = LL_DMA_UPDATE_CSAR | LL_DMA_UPDATE_CDAR;
		} else if (config->head_block->source_addr_adj == DMA_ADDR_ADJ_INCREMENT) {
			/* We update only source address */
			linked_list_node[0] = config->head_block->source_address;
			linked_list_flags = LL_DMA_UPDATE_CSAR;
		} else if (config->head_block->dest_addr_adj == DMA_ADDR_ADJ_INCREMENT) {
			/* We update only destination address */
			linked_list_node[0] = config->head_block->dest_address;
			linked_list_flags = LL_DMA_UPDATE_CDAR;
		}
		/* We update only destination address */
		LL_DMA_SetLinkedListBaseAddr(STM32_DMA_GET_CHANNEL(dma, id),
					     (uint32_t)&linked_list_node[0]);
		LL_DMA_ConfigLinkUpdate(STM32_DMA_GET_CHANNEL(dma, id), linked_list_flags,
					(uint32_t)&linked_list_node[0]);

		/* Continuous transfers with Linked List */
		stream->cyclic = true;
		LL_DMA_SetLinkStepMode(STM32_DMA_GET_CHANNEL(dma, id),
				       STM32_DMA_LINKEDLIST_EXECUTION_Q);

		LL_DMA_EnableIT_HT(STM32_DMA_GET_CHANNEL(dma, id));
	}

#ifdef CONFIG_ARM_SECURE_FIRMWARE
#ifdef CONFIG_STM32_HAL2
	LL_DMA_SetChannelSecurity(STM32_DMA_GET_CHANNEL(dma, id), LL_DMA_ATTR_SEC);
	LL_DMA_SetChannelPrivilege(STM32_DMA_GET_CHANNEL(dma, id), LL_DMA_ATTR_PRIV);
	LL_DMA_ConfigChannelAccessSecurity(STM32_DMA_GET_CHANNEL(dma, id),
		LL_DMA_ATTR_SEC, LL_DMA_ATTR_SEC);
#else /* CONFIG_STM32_HAL2 */
	LL_DMA_ConfigChannelSecure(STM32_DMA_GET_CHANNEL(dma, id),
		LL_DMA_CHANNEL_SEC | LL_DMA_CHANNEL_SRC_SEC | LL_DMA_CHANNEL_DEST_SEC);
	LL_DMA_EnableChannelPrivilege(STM32_DMA_GET_CHANNEL(dma, id));
#endif /* CONFIG_STM32_HAL2 */
#endif /* CONFIG_ARM_SECURE_FIRMWARE */

#if defined(CONFIG_SOC_SERIES_STM32H7RSX)
	if (dma == HPDMA1) {
		/* Overwrite the config in case of HPDMA */
		if (ll_direction == LL_DMA_DIRECTION_MEMORY_TO_PERIPH) {
			/* Assuming the Memory (Src) is sram0 on AXI bus : PORT0 else PORT1 */
			LL_DMA_SetSrcAllocatedPort(STM32_DMA_GET_CHANNEL(dma, id),
				LL_DMA_SRC_ALLOCATED_PORT0);
			LL_DMA_SetDestAllocatedPort(STM32_DMA_GET_CHANNEL(dma, id),
				LL_DMA_DEST_ALLOCATED_PORT1);
		} else if (ll_direction == LL_DMA_DIRECTION_PERIPH_TO_MEMORY) {
			/* Assuming the Memory (Dest) is sram0 on AXI bus : PORT0 else PORT1 */
			LL_DMA_SetSrcAllocatedPort(STM32_DMA_GET_CHANNEL(dma, id),
				LL_DMA_SRC_ALLOCATED_PORT1);
			LL_DMA_SetDestAllocatedPort(STM32_DMA_GET_CHANNEL(dma, id),
				LL_DMA_DEST_ALLOCATED_PORT0);
		} else {
			/* MEM_TO_MEM: Assuming the Memory is sram0 on AXI bus : PORT0 else PORT1 */
			LL_DMA_SetSrcAllocatedPort(STM32_DMA_GET_CHANNEL(dma, id),
				LL_DMA_SRC_ALLOCATED_PORT0);
			LL_DMA_SetDestAllocatedPort(STM32_DMA_GET_CHANNEL(dma, id),
				LL_DMA_DEST_ALLOCATED_PORT0);
			/* Set Config burst to 8 for Src and Dest on this Channel */
			LL_DMA_ConfigBurstLength(STM32_DMA_GET_CHANNEL(dma, id), 8, 8);
		}
	}
#endif /* CONFIG_SOC_SERIES_STM32H7RSX */

	LL_DMA_EnableIT_TC(STM32_DMA_GET_CHANNEL(dma, id));
	LL_DMA_EnableIT_USE(STM32_DMA_GET_CHANNEL(dma, id));
	LL_DMA_EnableIT_ULE(STM32_DMA_GET_CHANNEL(dma, id));
	LL_DMA_EnableIT_DTE(STM32_DMA_GET_CHANNEL(dma, id));

	return ret;
}

static int dma_stm32_reload(const struct device *dev, uint32_t id,
					  uint32_t src, uint32_t dst,
					  size_t size)
{
	const struct dma_stm32_config *config = dev->config;
	DMA_TypeDef *dma = (DMA_TypeDef *)(config->base);
	struct dma_stm32_stream *stream;

	if (id >= config->max_streams) {
		return -EINVAL;
	}

	stream = &config->streams[id];

