zephyrproject-rtos/zephyr/drivers/dma/dma_stm32u5.c
	if (dma_stm32_disable_stream(dma, id) != 0) {
		return -EBUSY;
	}

	if (stream->direction > PERIPHERAL_TO_MEMORY) {
		return -EINVAL;
	}

	LL_DMA_ConfigAddresses(STM32_DMA_GET_CHANNEL(dma, id), src, dst);
	LL_DMA_SetBlkDataLength(STM32_DMA_GET_CHANNEL(dma, id), size);

	/* When reloading the dma, the stream is busy again before enabling */
	stream->busy = true;

	stm32_dma_enable_stream(dma, id);

	return 0;
}

static int dma_stm32_start(const struct device *dev, uint32_t id)
{
	const struct dma_stm32_config *config = dev->config;
	DMA_TypeDef *dma = (DMA_TypeDef *)(config->base);
	struct dma_stm32_stream *stream;

	/* Only M2P or M2M mode can be started manually. */
	if (id >= config->max_streams) {
		return -EINVAL;
	}

	/* Repeated start : return now if channel is already started */
	if (stm32_dma_is_enabled_stream(dma, id)) {
		return 0;
	}

	/* When starting the dma, the stream is busy before enabling */
	stream = &config->streams[id];
	stream->busy = true;

	dma_stm32_clear_stream_irq(dev, id);

	stm32_dma_enable_stream(dma, id);

	return 0;
}

static int dma_stm32_suspend(const struct device *dev, uint32_t id)
{
	const struct dma_stm32_config *config = dev->config;
	DMA_TypeDef *dma = (DMA_TypeDef *)(config->base);

	if (id >= config->max_streams) {
		return -EINVAL;
	}

	/* Request channel suspension */
	LL_DMA_SuspendChannel(STM32_DMA_GET_CHANNEL(dma, id));

	/*
	 * Wait until the channel becomes effectively suspended (SUSPF).
	 * Also handle the case where the channel was/has become idle:
	 * the suspension request has no effect on idle channels and
	 * SUSPF will never be set in such cases.
	 *
	 * Note that this function is isr-ok so we MUST NOT rely on
	 * metadata updated by the ISR (such as stream->busy); only
	 * the hardware status flags are trustworthy here.
	 */
	do {
		/*
		 * It's not enough to wait for the SUSPF bit with
		 * LL_DMA_IsActiveFlag_SUSP - a delay is needed.
		 */
		k_busy_wait(800);
	} while (!LL_DMA_IsActiveFlag_SUSP(STM32_DMA_GET_CHANNEL(dma, id))
		 && !LL_DMA_IsActiveFlag_IDLE(STM32_DMA_GET_CHANNEL(dma, id)));

	/*
	 * Don't bother clearing the suspension request if the channel was idle
	 * (and has thus NOT been suspended) as only dma_resume() and dma_stop()
	 * are allowed to be called by the DMA API on "suspended" channels, and
	 * both of these functions will clear the suspension request.
	 *
	 * Obviously, also don't reset the channel to allow resuming it later.
	 */
	return 0;
}

static int dma_stm32_resume(const struct device *dev, uint32_t id)
{
	const struct dma_stm32_config *config = dev->config;
	DMA_TypeDef *dma = (DMA_TypeDef *)(config->base);

	if (id >= config->max_streams) {
		return -EINVAL;
	}

	/* Resume the channel : it's enough after suspend */
	LL_DMA_ResumeChannel(STM32_DMA_GET_CHANNEL(dma, id));

	return 0;
}

static int dma_stm32_stop(const struct device *dev, uint32_t id)
{
	const struct dma_stm32_config *config = dev->config;
	struct dma_stm32_stream *stream = &config->streams[id];
	DMA_TypeDef *dma = (DMA_TypeDef *)(config->base);

	if (id >= config->max_streams) {
		return -EINVAL;
	}

	if (stream->hal_override) {
		stream->busy = false;
		return 0;
	}

	/* Repeated stop : return now if channel is already stopped */
	if (!stm32_dma_is_enabled_stream(dma, id)) {
		return 0;
	}

	LL_DMA_DisableIT_TC(STM32_DMA_GET_CHANNEL(dma, id));
	LL_DMA_DisableIT_USE(STM32_DMA_GET_CHANNEL(dma, id));
	LL_DMA_DisableIT_ULE(STM32_DMA_GET_CHANNEL(dma, id));
	LL_DMA_DisableIT_DTE(STM32_DMA_GET_CHANNEL(dma, id));

	dma_stm32_clear_stream_irq(dev, id);
	dma_stm32_disable_stream(dma, id);

	/* Finally, flag stream as free */
	stream->busy = false;

	return 0;
}

static int dma_stm32_init(const struct device *dev)
{
	const struct dma_stm32_config *config = dev->config;
	const struct device *clk = DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE);

	if (clock_control_on(clk,
		(clock_control_subsys_t) &config->pclken) != 0) {
		LOG_ERR("clock op failed\n");
		return -EIO;
	}

#if defined(CONFIG_SOC_SERIES_STM32N6X) && defined(CONFIG_ARM_SECURE_FIRMWARE)
	DMA_TypeDef *dma = (DMA_TypeDef *)(config->base);

	if (dma == HPDMA1) {
		/* HPDMA supports per-channel CID configuration.
		 * Configure each channel to use CID1 as do other
		 * bus masters (see soc/st/stm32/stm32n6x/soc.c).
		 * Without this configuration, transfers would appear
		 * to complete but silently fail to move any data.
		 */
		for (uint32_t i = 0; i < config->max_streams; i++) {
			LL_DMA_SetStaticIsolation(dma, dma_stm32_id_to_stream(i),
						  LL_DMA_CHANNEL_STATIC_CID_1);
			LL_DMA_EnableIsolation(dma, dma_stm32_id_to_stream(i));
		}
	}
#endif /* CONFIG_SOC_SERIES_STM32N6X && CONFIG_ARM_SECURE_FIRMWARE */

	config->config_irq(dev);

	for (uint32_t i = 0; i < config->max_streams; i++) {
		config->streams[i].busy = false;
	}

	((struct dma_stm32_data *)dev->data)->dma_ctx.magic = 0;
	((struct dma_stm32_data *)dev->data)->dma_ctx.dma_channels = 0;
	((struct dma_stm32_data *)dev->data)->dma_ctx.atomic = 0;

	return 0;
}

static int dma_stm32_get_status(const struct device *dev,
				uint32_t id, struct dma_status *stat)
{
	const struct dma_stm32_config *config = dev->config;
	DMA_TypeDef *dma = (DMA_TypeDef *)(config->base);
	struct dma_stm32_stream *stream;

	if (id >= config->max_streams) {
		return -EINVAL;
	}

	stream = &config->streams[id];
	stat->pending_length = LL_DMA_GetBlkDataLength(STM32_DMA_GET_CHANNEL(dma, id));
	stat->dir = stream->direction;
	stat->busy = stream->busy;

	return 0;
}

static DEVICE_API(dma, dma_funcs) = {
	.reload		 = dma_stm32_reload,
	.config		 = dma_stm32_configure,
	.start		 = dma_stm32_start,
	.stop		 = dma_stm32_stop,
	.get_status	 = dma_stm32_get_status,
	.suspend	 = dma_stm32_suspend,
	.resume		 = dma_stm32_resume,
};

/*
 * Macro to CONNECT and enable each irq (order is given by the 'listify')
 * chan: channel of the DMA instance (assuming one irq per channel)
 *       stm32U5x has 16 channels
 * dma : dma instance (one GPDMA instance on stm32U5x)
 */
#define DMA_STM32_IRQ_CONNECT_CHANNEL(chan, dma)			\
	do {								\
		IRQ_CONNECT(DT_INST_IRQ_BY_IDX(dma, chan, irq),		\
			    DT_INST_IRQ_BY_IDX(dma, chan, priority),	\
			    dma_stm32_irq_##dma##_##chan,		\
			    DEVICE_DT_INST_GET(dma), 0);		\
		irq_enable(DT_INST_IRQ_BY_IDX(dma, chan, irq));		\
	} while (0)

